Tags:     
<code style="background:lightskyblue;color:black">EASY</code> 

<code style="background:sandybrown;color:black">MEDIUM</code>   

<code style="background:lightcoral;color:black">HARD</code>

<code style="background:pink;color:black">REVISIT</code>

In [1]:
!pip install ipython-sql

Collecting ipython-sql
  Downloading https://files.pythonhosted.org/packages/ab/3d/0d38357c620df31cebb056ca1804027112e5c008f4c2c0e16d879996ad9f/ipython_sql-0.4.0-py3-none-any.whl
Requirement already satisfied: prettytable<1 in /opt/miniconda3/lib/python3.7/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in /opt/miniconda3/lib/python3.7/site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: ipython>=1.0 in /opt/miniconda3/lib/python3.7/site-packages (from ipython-sql) (7.12.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /opt/miniconda3/lib/python3.7/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /opt/miniconda3/lib/python3.7/site-packages (from ipython-sql) (1.3.19)
Collecting sqlparse
  Downloading https://files.pythonhosted.org/packages/14/05/6e8eb62ca685b10e34051a80d7ea94b7137369d8c0be5c3b9d9b6e3f5dae/sqlparse-0.4.1-py3-none-any.whl (42kB)
     |████████████████████████████████| 51kB 3.7MB/s eta 0:00:011
Requirement already satisfied: appnope; sys_platform == "darwin" in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: pickleshare in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.4.1)
Requirement already satisfied: setuptools>=18.5 in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (41.4.0)
Requirement already satisfied: pygments in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.5.2)
Requirement already satisfied: traitlets>=4.2 in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: jedi>=0.10 in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.16.0)
Requirement already satisfied: backcall in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: pexpect; sys_platform != "win32" in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /opt/miniconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (3.0.3)
Requirement already satisfied: parso>=0.5.2 in /opt/miniconda3/lib/python3.7/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.6.1)
Requirement already satisfied: ptyprocess>=0.5 in /opt/miniconda3/lib/python3.7/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)
Requirement already satisfied: wcwidth in /opt/miniconda3/lib/python3.7/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.8)
Installing collected packages: sqlparse, ipython-sql
Successfully installed ipython-sql-0.4.0 sqlparse-0.4.1

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

# SQL

### 1270. All People Report to the Given Manager <code style="background:sandybrown;color:black">MEDIUM</code>  

employee_id is the primary key for this table.   
Each row of this table indicates that the employee with ID employee_id and name employee_name reports his work to his/her direct manager with manager_id   
The head of the company is the employee with employee_id = 1.    
   
**Question**:   
Write an SQL query to find employee_id of all employees that directly or indirectly report their work to the head of the company.
   
The indirect relation between managers will not exceed 3 managers as the company is small.
   
Return result table in any order without duplicates.    

**Example**:

In [5]:
# Employees table:
# +-------------+---------------+------------+
# | employee_id | employee_name | manager_id |
# +-------------+---------------+------------+
# | 1           | Boss          | 1          |
# | 3           | Alice         | 3          |
# | 2           | Bob           | 1          |
# | 4           | Daniel        | 2          |
# | 7           | Luis          | 4          |
# | 8           | Jhon          | 3          |
# | 9           | Angela        | 8          |
# | 77          | Robert        | 1          |
# +-------------+---------------+------------+

# Result table:
# +-------------+
# | employee_id |
# +-------------+
# | 2           |
# | 77          |
# | 4           |
# | 7           |
# +-------------+

In [3]:
# SQL schema 
%%sql
drop table if exists Employees;
create table Employees (employee_id int, employee_name varchar(30), manager_id int);
insert into Employees (employee_id, employee_name, manager_id) values ('1', 'Boss', '1');
insert into Employees (employee_id, employee_name, manager_id) values ('3', 'Alice', '3');
insert into Employees (employee_id, employee_name, manager_id) values ('2', 'Bob', '1');
insert into Employees (employee_id, employee_name, manager_id) values ('4', 'Daniel', '2');
insert into Employees (employee_id, employee_name, manager_id) values ('7', 'Luis', '4');
insert into Employees (employee_id, employee_name, manager_id) values ('8', 'John', '3');
insert into Employees (employee_id, employee_name, manager_id) values ('9', 'Angela', '8');
insert into Employees (employee_id, employee_name, manager_id) values ('77', 'Robert', '1');

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql
select * from employees

 * sqlite://
Done.

[(1, 'Boss', 1),
 (3, 'Alice', 3),
 (2, 'Bob', 1),
 (4, 'Daniel', 2),
 (7, 'Luis', 4),
 (8, 'John', 3),
 (9, 'Angela', 8),
 (77, 'Robert', 1)]

In [11]:
%%sql 
select * from 
Employees a join Employees b 
on a.manager_id = b.employee_id 
join Employees c 
on b.manager_id = c.employee_id 
where c.manager_id = 1 and a.employee_id != 1

 * sqlite://
Done.

[(2, 'Bob', 1, 1, 'Boss', 1, 1, 'Boss', 1),
 (77, 'Robert', 1, 1, 'Boss', 1, 1, 'Boss', 1),
 (4, 'Daniel', 2, 2, 'Bob', 1, 1, 'Boss', 1),
 (7, 'Luis', 4, 4, 'Daniel', 2, 2, 'Bob', 1)]

In [15]:
%%sql
drop table if exists triangle;
Create table If Not Exists triangle (x int, y int, z int);
insert into triangle (x, y, z) values ('13', '15', '30');
insert into triangle (x, y, z) values ('10', '20', '15');
select * from triangle;

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
Done.

[(13, 15, 30), (10, 20, 15)]

In [16]:
%%sql 
select x,y,z,
case when (x+y > z AND y+z > x AND x+z > y) then 'Yes' 
else 'No' end as triangle 
from triangle;

 * sqlite://
Done.

[(13, 15, 30, 'No'), (10, 20, 15, 'Yes')]

In [18]:
%%sql
drop table if exists Customers;
drop table if exists Product;
drop table if exists Orders;
Create table If Not Exists Customers (customer_id int, name varchar(30), country varchar(30));
Create table If Not Exists Product (product_id int, description varchar(30), price int);
Create table If Not Exists Orders (order_id int, customer_id int, product_id int, order_date date, quantity int);
insert into Customers (customer_id, name, country) values ('1', 'Winston', 'USA');
insert into Customers (customer_id, name, country) values ('2', 'Jonathan', 'Peru');
insert into Customers (customer_id, name, country) values ('3', 'Moustafa', 'Egypt');
insert into Product (product_id, description, price) values ('10', 'LC Phone', '300');
insert into Product (product_id, description, price) values ('20', 'LC T-Shirt', '10');
insert into Product (product_id, description, price) values ('30', 'LC Book', '45');
insert into Product (product_id, description, price) values ('40', 'LC Keychain', '2');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('1', '1', '10', '2020-06-10', '1');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('2', '1', '20', '2020-07-01', '1');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('3', '1', '30', '2020-07-08', '2');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('4', '2', '10', '2020-06-15', '2');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('5', '2', '40', '2020-07-01', '10');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('6', '3', '20', '2020-06-24', '2');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('7', '3', '30', '2020-06-25', '2');
insert into Orders (order_id, customer_id, product_id, order_date, quantity) values ('9', '3', '30', '2020-05-08', '3');
select * from Customers;

 * sqlite://
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Winston', 'USA'), (2, 'Jonathan', 'Peru'), (3, 'Moustafa', 'Egypt')]

In [19]:
%%sql
select * from Product;

 * sqlite://
Done.

[(10, 'LC Phone', 300),
 (20, 'LC T-Shirt', 10),
 (30, 'LC Book', 45),
 (40, 'LC Keychain', 2)]

In [20]:
%%sql
select * from Orders;

 * sqlite://
Done.

[(1, 1, 10, '2020-06-10', 1),
 (2, 1, 20, '2020-07-01', 1),
 (3, 1, 30, '2020-07-08', 2),
 (4, 2, 10, '2020-06-15', 2),
 (5, 2, 40, '2020-07-01', 10),
 (6, 3, 20, '2020-06-24', 2),
 (7, 3, 30, '2020-06-25', 2),
 (9, 3, 30, '2020-05-08', 3)]

In [56]:
%%sql 

select customer_id, name
from customers join orders using(customer_id) 
join product using(product_id) 
group by customer_id
having 





sum(if(order_date between '2020-06-01' and '2020-06-30', quantity, 0)*price) >= 100 
and sum(if(order_date between '2020-07-01' and '2020-07-31', quantity, 0)*price) >= 100

 * sqlite://
(sqlite3.OperationalError) no such function: if
[SQL: select customer_id, name from customers join orders using(customer_id)
join product using(product_id)
group by customer_id
having sum(if(order_date between '2020-06-01' and '2020-06-30', quantity, 0)*price) >= 100
and sum(if(order_date between '2020-07-01' and '2020-07-31', quantity, 0)*price) >= 100]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [60]:
import pandas as pd
import pandasql as ps

df = pd.DataFrame({'A':[5,6,7], 'B':[7,8,9]})
print(df)

qry = """SELECT * FROM df;"""
df1 = ps.sqldf(qry, globals())
print(df1)

   A  B
0  5  7
1  6  8
2  7  9
   A  B
0  5  7
1  6  8
2  7  9